; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
 :parameters (?o1 ?o2 ?o3)
 :precondition (and (smaller ?o3 ?o1)
 	       	    (on ?o1 ?o2)
		    (clear ?o1)
		    (clear ?o3))
 :effect  (and (clear ?o2)
 	       (on ?o1 ?o3)
	       (not (on ?o1 ?o2))
	       (not (clear ?o3)))))

; problem
(define (problem hanoi-4)
  (:domain hanoi)
  (:objects d2 -  object peg1 -  object peg2 -  object peg3 -  object d1 -  object d3 -  object d4 -  object )
  (:init (smaller peg2 d1) (smaller d3 d3) (clear d1) (smaller peg2 d4) (smaller d1 d1) (smaller peg1 d4) (smaller peg1 d2) (smaller d4 d2) (on d4 peg1) (smaller peg1 d1) (smaller peg3 d2) (smaller d3 d1) (smaller d4 d3) (smaller peg3 d4) (smaller d4 d1) (smaller d3 d2) (smaller peg3 d1) (smaller peg3 d3) (smaller d2 d1) (smaller peg1 d3) (smaller d2 d2) (smaller peg2 d2) (smaller peg2 d3) (clear d3) (on d2 peg3) (on d1 d2) (clear d4) (on d3 peg2) )
  (:goal (and (smaller peg2 d1)(smaller d3 d3)(clear d1)(smaller peg2 d4)(smaller d1 d1)(smaller peg1 d4)(smaller peg1 d2)(smaller d4 d2)(smaller peg1 d1)(smaller peg3 d2)(smaller d3 d1)(smaller d4 d3)(smaller peg3 d4)(smaller d4 d1)(smaller d3 d2)(smaller peg3 d1)(smaller peg3 d3)(smaller d2 d1)(smaller peg1 d3)(smaller d2 d2)(smaller peg2 d2)(smaller peg2 d3)(on d3 peg2)(on d2 d3)(clear d4)(on d1 d2)(clear peg1)(on d4 peg3)(not (clear peg2))(not (clear peg3))(not (clear d2))(not (clear d3))(not (on peg1 peg1))(not (on peg1 peg2))(not (on peg1 peg3))(not (on peg1 d1))(not (on peg1 d2))(not (on peg1 d3))(not (on peg1 d4))(not (on peg2 peg1))(not (on peg2 peg2))(not (on peg2 peg3))(not (on peg2 d1))(not (on peg2 d2))(not (on peg2 d3))(not (on peg2 d4))(not (on peg3 peg1))(not (on peg3 peg2))(not (on peg3 peg3))(not (on peg3 d1))(not (on peg3 d2))(not (on peg3 d3))(not (on peg3 d4))(not (on d1 peg1))(not (on d1 peg2))(not (on d1 peg3))(not (on d1 d1))(not (on d1 d3))(not (on d1 d4))(not (on d2 peg1))(not (on d2 peg2))(not (on d2 peg3))(not (on d2 d1))(not (on d2 d2))(not (on d2 d4))(not (on d3 peg1))(not (on d3 peg3))(not (on d3 d1))(not (on d3 d2))(not (on d3 d3))(not (on d3 d4))(not (on d4 peg1))(not (on d4 peg2))(not (on d4 d1))(not (on d4 d2))(not (on d4 d3))(not (on d4 d4))(not (smaller peg1 peg1))(not (smaller peg1 peg2))(not (smaller peg1 peg3))(not (smaller peg2 peg1))(not (smaller peg2 peg2))(not (smaller peg2 peg3))(not (smaller peg3 peg1))(not (smaller peg3 peg2))(not (smaller peg3 peg3))(not (smaller d1 peg1))(not (smaller d1 peg2))(not (smaller d1 peg3))(not (smaller d1 d2))(not (smaller d1 d3))(not (smaller d1 d4))(not (smaller d2 peg1))(not (smaller d2 peg2))(not (smaller d2 peg3))(not (smaller d2 d3))(not (smaller d2 d4))(not (smaller d3 peg1))(not (smaller d3 peg2))(not (smaller d3 peg3))(not (smaller d3 d4))(not (smaller d4 peg1))(not (smaller d4 peg2))(not (smaller d4 peg3))(not (smaller d4 d4)))))

; plan
1. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 95 of 105
2. (move d2 peg3 d3)
   deleted: (on d2 peg3) (clear d3)
   added: (clear peg3) (on d2 d3)
   goals met: 97 of 105
3. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 101 of 105
4. (move d4 peg1 peg3)
   deleted: (on d4 peg1) (clear peg3)
   added: (clear peg1) (on d4 peg3)
   goals met: 105 of 105
